zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/LPC/LPC54000/LPC54S018M/drivers/fsl_clock.c
    command[0] = 55U;
    result[0]  = 0;
    result[1]  = 0;
    ((void (*)(uint32_t cmd[5], uint32_t stat[4]))FSL_FEATURE_SYSCON_IAP_ENTRY_LOCATION)(command, result);

    *romVersion = (uint8_t)(result[1] & 0xFFU);

    return result[0];
}
#endif

/**
 * brief
 *  Initialize the Core clock to given frequency (12, 48 or 96 MHz), this API is implememnt in ROM code.
 * Turns on FRO and uses default CCO, if freq is 12000000, then high speed output is off, else high speed
 * output is enabled.
 * Usage: CLOCK_SetupFROClocking(frequency), (frequency must be one of 12, 48 or 96 MHz)
 *  Note: Need to make sure ROM and OTP has power(PDRUNCFG0[17,29]= 0U) before calling this API since this API is
 * implemented in ROM code and the FROHF TRIM value is stored in OTP
 *
 * param froFreq target fro frequency.
 * return   Nothing
 */

void CLOCK_SetupFROClocking(uint32_t froFreq)
{
    uint32_t froRomAddr = 0U;
#if defined(FSL_FROHF_SETTING_API_ADDRESS_DETERMINE_BY_ROM_VERSION) && \
    (FSL_FROHF_SETTING_API_ADDRESS_DETERMINE_BY_ROM_VERSION)
    uint8_t romVersion = 0U;

    if (CLOCK_GetRomVersion(&romVersion) == (uint32_t)kStatus_Success)
    {
        if (romVersion == FSL_ROM_VERSION_1B)
        {
            froRomAddr = FSL_ROM_VERSION_1B_FRO_SETTING_ADDR;
        }
        else
        {
            froRomAddr = FSL_ROM_VERSION_0A_FRO_SETTING_ADDR;
        }

        (*((void (*)(uint32_t funcname))(froRomAddr)))(froFreq);
    }
#else
    froRomAddr = FSL_ROM_VERSION_0A_FRO_SETTING_ADDR;

    (*((void (*)(uint32_t))(froRomAddr)))(froFreq);
#endif
}

/* Clock Selection for IP */
/**
 * brief	Configure the clock selection muxes.
 * param	connection	: Clock to be configured.
 * return	Nothing
 */
void CLOCK_AttachClk(clock_attach_id_t connection)
{
    assert((int32_t)connection >= 0);
    if ((int32_t)connection >= 0)
    {
        uint8_t mux;
        uint8_t sel;
        uint16_t item;
        uint32_t tmp32 = (uint32_t)connection;
        uint32_t i;
        volatile uint32_t *pClkSel;

        pClkSel = &(SYSCON->STICKCLKSEL);

        if (kNONE_to_NONE != connection)
        {
            for (i = 0U; i < 2U; i++)
            {
                if (tmp32 == 0U)
                {
                    break;
                }
                item = (uint16_t)GET_ID_ITEM(tmp32);
                if (item != 0UL)
                {
                    mux = GET_ID_ITEM_MUX(item);
                    {
                        uint32_t selField = ((uint32_t)item & 0xF00U) >> 8U;
                        sel               = (selField > 0U) ? (uint8_t)(selField - 1U) : 0U;
                    }
                    if (mux == CM_ASYNCAPB)
                    {
                        SYSCON->ASYNCAPBCTRL          = SYSCON_ASYNCAPBCTRL_ENABLE(1);
                        ASYNC_SYSCON->ASYNCAPBCLKSELA = sel;
                    }
                    else
                    {
                        ((volatile uint32_t *)pClkSel)[mux] = sel;
                    }
                }
                tmp32 = GET_ID_NEXT_ITEM(tmp32); /* pick up next descriptor */
            }
        }
    }
}

/* Return the actual clock attach id */
/**
 * brief   Get the actual clock attach id.
 * This fuction uses the offset in input attach id, then it reads the actual source value in
 * the register and combine the offset to obtain an actual attach id.
 * param   attachId  : Clock attach id to get.
 * return  Clock source value.
 */
clock_attach_id_t CLOCK_GetClockAttachId(clock_attach_id_t attachId)
{
    if (kNONE_to_NONE == attachId)
    {
        return kNONE_to_NONE;
    }

    assert((int32_t)attachId >= 0);
    if ((int32_t)attachId >= 0)
    {
        uint8_t mux;
        uint8_t actualSel;
        uint32_t tmp32 = (uint32_t)attachId;
        uint32_t i;
        uint32_t actualAttachId = 0U;
        uint32_t selector       = GET_ID_SELECTOR(tmp32);
        volatile uint32_t *pClkSel;

        pClkSel = &(SYSCON->STICKCLKSEL);

        for (i = 0U; i < 2U; i++)
        {
            mux = GET_ID_ITEM_MUX(tmp32);
            if (tmp32 != 0UL)
            {
                if (mux == CM_ASYNCAPB)
                {
                    actualSel = (uint8_t)(ASYNC_SYSCON->ASYNCAPBCLKSELA & 0xFFU);
                }
                else
                {
                    actualSel = (uint8_t)(((volatile uint32_t *)pClkSel)[mux] & 0xFFU);
                }

                /* Consider the combination of two registers */
                actualAttachId |= CLK_ATTACH_ID(mux, actualSel, i);
            }
            tmp32 = GET_ID_NEXT_ITEM(tmp32); /*!<  pick up next descriptor */
        }

        actualAttachId |= selector;
        assert(actualAttachId < 0xFFFFFFFFU);
        return (clock_attach_id_t)actualAttachId;
    }

    return (clock_attach_id_t)0U; /* unreachable for valid inputs */
}

/* Set IP Clock Divider */
/**
 * brief	Setup peripheral clock dividers.
 * param	div_name	: Clock divider name
 * param divided_by_value: Value to be divided
 * param reset :  Whether to reset the divider counter.
 * return	Nothing
 */
void CLOCK_SetClkDiv(clock_div_name_t div_name, uint32_t divided_by_value, bool reset)
{
    volatile uint32_t *pClkDiv;

    pClkDiv = &(SYSCON->SYSTICKCLKDIV);
    if (reset)
    {
        ((volatile uint32_t *)pClkDiv)[(uint8_t)div_name] = 1UL << 29U;
    }
    if (divided_by_value == 0U) /*!<  halt */
    {
        ((volatile uint32_t *)pClkDiv)[(uint8_t)div_name] = 1UL << 30U;
    }
    else
    {
        ((volatile uint32_t *)pClkDiv)[(uint8_t)div_name] = (divided_by_value - 1U);
    }
}

/* Get CLOCK OUT Clk */
/*! brief	Return Frequency of ClockOut
 *  return	Frequency of ClockOut
 */
uint32_t CLOCK_GetClockOutClkFreq(void)
{
    uint32_t freq = 0U;

    switch (SYSCON->CLKOUTSELA)
    {
        case 0U:
            freq = CLOCK_GetCoreSysClkFreq();
            break;

        case 1U:
            freq = CLOCK_GetExtClkFreq();
            break;

        case 2U:
            freq = CLOCK_GetWdtOscFreq();
            break;

        case 3U:
            freq = CLOCK_GetFroHfFreq();
            break;

        case 4U:
            freq = CLOCK_GetPllOutFreq();
            break;

